## staging: manifest_secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_secretsmanager_secret.manifest_cache_ops_url`             |
|        | `aws_secretsmanager_secret_version.manifest_cache_ops_url`     |
| delete | `aws_secretsmanager_secret.manifest_redis_publish_url`         |
|        | `aws_secretsmanager_secret_version.manifest_redis_publish_url` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_secretsmanager_secret.manifest_cache_ops_url will be created
  + resource "aws_secretsmanager_secret" "manifest_cache_ops_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_CACHE_OPS_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_redis_publish_url will be destroyed
  # (because aws_secretsmanager_secret.manifest_redis_publish_url is not in configuration)
  - resource "aws_secretsmanager_secret" "manifest_redis_publish_url" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
      - name                           = "MANIFEST_REDIS_PUBLISH_URL" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.manifest_cache_ops_url will be created
  + resource "aws_secretsmanager_secret_version" "manifest_cache_ops_url" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_redis_publish_url will be destroyed
  # (because aws_secretsmanager_secret_version.manifest_redis_publish_url is not in configuration)
  - resource "aws_secretsmanager_secret_version" "manifest_redis_publish_url" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii|terraform-20250702175453505000000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20250702175453505000000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_admin_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_auth_tokens"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_route53_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_clear_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_ops_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_crm_github_personal_access_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_auth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_user_pw_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_dangerous_salt"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_debug_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_pat"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_username"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_document_download_api_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
